app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Zak's Shitty Pancakes"], ["created_at", 2016-08-22 16:15:23 UTC], ["updated_at", 2016-08-22 16:15:23 UTC], ["description", "Totally Shitty"]]
---
  def create
    @restaurant = Restaurant.create(restaurant_params)